"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.topicsMap = exports.topics = void 0;
exports.topics = [
    { id: 1, name: 'Вступ до історії України' },
    { id: 2, name: 'Стародавня історія України' },
    { id: 3, name: 'Русь-Україна (Київська держава)' },
    {
        id: 4,
        name: 'Королівство Руське (Галицько-Волинська держава). Монгольська навала',
    },
    {
        id: 5,
        name: 'Руські удільні князівства у складі іноземних держав у другій половині XIV - перші половині XVI ст. Кримське ханство',
    },
    {
        id: 6,
        name: 'Українські землі у складі Речі Посполитої в другій половині XVI ст.',
    },
    {
        id: 7,
        name: 'Українські землі у складі Речі Посполитої в першій половині XVII ст.',
    },
    {
        id: 8,
        name: 'Національно-визвольна війна українського народу середини XVII ст.',
    },
    { id: 9, name: 'Козацька Україна наприкінці 50 - 80-х рр. XVII ст.' },
    {
        id: 10,
        name: 'Українські землі наприкінці XVII - в першій половині XVIII ст.',
    },
    { id: 11, name: 'Українські землі в другій половині XVIII ст.' },
    {
        id: 12,
        name: 'Українські землі у складі Російської імперії наприкінці XVIII- в першій половині XIX ст.',
    },
    {
        id: 13,
        name: 'Українські землі у складі Австрійської імперії наприкінці XVIII - в першій половині XIX ст.',
    },
    {
        id: 14,
        name: 'Культура України кінця XVIII- першої половини XIX ст.',
    },
    {
        id: 15,
        name: 'Українські землі у складі Російської імперії в другій половині XIX ст.',
    },
    {
        id: 16,
        name: 'Українські землі у складі Австро-Угорщини в другій половині XIX ст',
    },
    {
        id: 17,
        name: 'Культура України б другій половині XIX - на початку XX ст',
    },
    {
        id: 18,
        name: 'Українські землі у складі Російської імперії в 1900-1914 рр.',
    },
    {
        id: 19,
        name: 'Українські землі у складі Австро-Угорщини в 1900-1914 рр.',
    },
    { id: 20, name: 'Україна в роки Першої світової війни' },
    { id: 21, name: 'Початок Української революції' },
    {
        id: 22,
        name: 'Розгортання Української революції. Боротьба за відновлення державності',
    },
    {
        id: 23,
        name: 'Встановлення комуністичного тоталітарного режиму в Україні',
    },
    {
        id: 24,
        name: 'Утвердження більшовицького тоталітарного режиму в Україні',
    },
    { id: 25, name: 'Західноукраїнські землі в міжвоєнний період' },
    { id: 26, name: 'Україна в роки Другої світової війни' },
    { id: 27, name: 'Україна в перші повоєнні роки' },
    { id: 28, name: 'Україна в умовах десталінізації' },
    {
        id: 29,
        name: 'Україна в період загострення кризи радянської системи',
    },
    { id: 30, name: 'Відновлення незалежності України' },
    { id: 31, name: 'Становлення України як незалежної держави' },
    { id: 32, name: 'Творення нової України' },
];
// export const topics = topicsData.reduce((acc, {name, id}) => {
//   acc[name] = id;
//   return acc;
// }, {});
exports.topicsMap = {
    'Вступ до історії України': 1,
    'Стародавня історія України': 2,
    'Русь-Україна (Київська держава)': 3,
    'Королівство Руське (Галицько-Волинська держава). Монгольська навала': 4,
    'Руські удільні князівства у складі іноземних держав у другій половині XIV - перші половині XVI ст. Кримське ханство': 5,
    'Українські землі у складі Речі Посполитої в другій половині XVI ст.': 6,
    'Українські землі у складі Речі Посполитої в першій половині XVII ст.': 7,
    'Національно-визвольна війна українського народу середини XVII ст.': 8,
    'Козацька Україна наприкінці 50 - 80-х рр. XVII ст.': 9,
    'Українські землі наприкінці XVII - в першій половині XVIII ст.': 10,
    'Українські землі в другій половині XVIII ст.': 11,
    'Українські землі у складі Російської імперії наприкінці XVIII- в першій половині XIX ст.': 12,
    'Українські землі у складі Австрійської імперії наприкінці XVIII - в першій половині XIX ст.': 13,
    'Культура України кінця XVIII- першої половини XIX ст.': 14,
    'Українські землі у складі Російської імперії в другій половині XIX ст.': 15,
    'Українські землі у складі Австро-Угорщини в другій половині XIX ст': 16,
    'Культура України б другій половині XIX - на початку XX ст': 17,
    'Українські землі у складі Російської імперії в 1900-1914 рр.': 18,
    'Українські землі у складі Австро-Угорщини в 1900-1914 рр.': 19,
    'Україна в роки Першої світової війни': 20,
    'Початок Української революції': 21,
    'Розгортання Української революції. Боротьба за відновлення державності': 22,
    'Встановлення комуністичного тоталітарного режиму в Україні': 23,
    'Утвердження більшовицького тоталітарного режиму в Україні': 24,
    'Західноукраїнські землі в міжвоєнний період': 25,
    'Україна в роки Другої світової війни': 26,
    'Україна в перші повоєнні роки': 27,
    'Україна в умовах десталінізації': 28,
    'Україна в період загострення кризи радянської системи': 29,
    'Відновлення незалежності України': 30,
    'Становлення України як незалежної держави': 31,
    'Творення нової України': 32,
};
